var a = 2;

foo();

function foo() {
    a = 3; // и здесь мы присваиваем ей значение

    console.log(a);

    var a; // объявление переменной принадлежит всей области видимости и 
    // доступно в любом месте внутри области.
}

console.log(a);


/*
Метафорически это поведение называется поднятие (hoisting), 
когда объявление var концептуально "перемещается" на вершину 
своей объемлющей области видимости. 
*/


function foo() {
    a = 1;	// `a` формально не объявлена
}

foo();
a;

function qwe() {
    asd()
    function asd() {
        d = 1
    }
}
qwe()
d;
/*
Если написать прменную которая не объявленна то она автоматически перенесется 
в глобальную область видимости
*/

