// лексическое окружение сначала декларирует функцию поэтому
// декларировать ее можно в любом месте 

// а чтобы получить доступ к переменной она должна быть задекларированна ДО
// вызова функции иначе undefined

var a = 'Hello'


qwe() // Hello

var a = 'Hi'
// новое лексическое окружение функции создаётся каждый раз, когда функция выполняется
qwe() // Hi


function qwe() {
    console.log(a)
}

/*
«Лексическое окружение» – это специальный внутренний объект. 
Мы не можем получить его в нашем коде и изменять напрямую. 
Сам движок JavaScript может оптимизировать его, уничтожать неиспользуемые 
переменные для освобождения памяти и выполнять другие внутренние уловки, 
но видимое поведение объекта должно оставаться таким, как было описано. 
*/