a = b * 2
// a && b пременные которые хранят значения 
// 2 в этом случае это литеральное значение так как не хранится в переменной


// Программы — это всего лишь набор стольких операторов, 
// сколько необходимо для того, чтобы описать все шаги 
// для достижения цели вашей программы

// "Переменная" – это просто свойство специального внутреннего объекта:
// Environment Record. «Получить или изменить переменную», означает, 
// «получить или изменить свойство этого объекта»

// Почему инкрементный оператор не с первого раза добавляет +1    1++ ???  Выяснил
// Литералы ?